[
  {
    "q": "What is the wallet balance?",
    "a": "UG Wallet Assets include two separate account systems - Wallet Balance and Blockchain Accounts. The two sets of account system independent of each other and does not impact relatively. The balance account is automatically created by the back-end system when the user logs in. The balance of the wallet store users’ provisions and it can be used without paying the miners on the chain. Balance will credit in real-time without waiting for the packing of the block. The balance is obtained by recharging. The balance in the wallet cannot be transferred or withdrawn. In UG wallet, the operation such as registration and login only aims at the balance account, but not the blockchain account, and the information of blockchain account is stored in the blockchain as decentralized form. The balance of the wallet is secured by binding the mobile phone number and email, etc., If it’s lost, users can contact with the customer service to appeal and get back the credentials. But the blockchain account cannot be recovered by the official agency, so users need to back up and save the account information by their own."
  },
  {
    "q": "How to recharge the balance?",
    "a": "Users can use UGT of their own blockchain account to recharge, transfer UGT into a specific address. Once the transfer is succeeded, appropriate amount will be added to the balance."
  },
  {
    "q": "How to create a blockchain account?",
    "a": "<div>Method 1 <br/>1、l Click 【Account Managment】 at the home page, and click 【Create Account】<br/>2、l Fill in the account name (required), password (password for this account, users can not retrieve if it’s lost , please back up), then confirm the password<br/>3、l Click to create an account </div> <div> Method 2 <br/>l While using for the first time, click 【blockchain assets】, then enter the page and click 【Create new account】</div>"
  },
  {
    "q": "How to import the blockchain account?",
    "a": "UG wallet supports import by mnemonic, private key, wallet file and picture. Users can select 【Account Management】 on the home page, click 【Import Account】, select one importing method, then follow the prompts to select or enter the corresponding content to complete ."
  },
  {
    "q": "What should I do if I forget the blockchain account password ?",
    "a": "UG wallet back-end does not store your blockchain account password, so if user lose the password, it cannot be retrieved. For security reasons, please backup your password. Backup contents such as private key and mnemonic include all the information of the blockchain account, user can use the backup file to import the original account on the new device ,it will not affect the property safety . However, if the account is not backed up, the account cannot be retrieved when it is lost."
  },
  {
    "q": "How to transfer in/out?",
    "a": "Select 【Transfer】 at the bottom menu, fill in the required information such as payment address, transfer amount, Gas price, and click 【Confirm Transfer】.<br />To transfer in, please select the corresponding account, and then click on the menu in the upper right corner on the【Account】 page, then select 【payment code】, display the QR code to the payer."
  },
  {
    "q": "If I don’t have ETH, can I transfer out/in?",
    "a": "UGT and ETH transfers need to pay by ETH. If you do not have ETH in your account, you will not be able to make a transfer because the transaction fee is paid by ETH. If your transaction is failed, check if there’s enough ETH in your account."
  },
  {
    "q": "What is GAS fee?",
    "a": "Running a smart contract in Ethereum costs money and transaction fee is paid to miners who keep the accounts. Ethereum's transaction fee = gas * gas price (the unit price of gas, quoted in ETH). Different operations require different numbers of gas. The more complicated the calculation, the more gas required. So, if you want to run a smart contract, you need to buy gas with ETH. GAS is like the fuel for running smart contracts, just as cars run with gasoline."
  },
  {
    "q": "How to delete a blockchain account?",
    "a": "Tip: Make sure to check whether it has been backed up before deleting an account. If it is not backed up, it will not be restored once deleted.<br/>Click 【Account Management】in the home page, select the account you want to delete, click the small arrow on the right to enter the account details, then click【Delete Account】, enter the corresponding account password and confirm the deletion."
  },
  {
    "q": "What is the status of 'transaction succeed and please wait for confirmation' displayed after successful transaction?",
    "a": "The transfer on the blockchain needs to be confirmed by 12 blocks and then the transfer will be successful. “Wait for the confirmation” means your transfer request has been sent to the chain, and need to wait for block confirmation which will take about ten minutes. You can view the transaction confirmation on the【blockchain asset transaction details】."
  },
  {
    "q": "Why do I need to backup the blockchain account?",
    "a": "The information of blockchain account is not stored by the central server, all the account information is stored in the private key, and cannot be recovered through centralized server if its lost. Person with the private key owns the account. Everyone who has the backup file can restore the account, different backup methods have the same effect."
  },
  {
    "q": "How to backup account?",
    "a": "There are three ways to back up your account. You can back up the mnemonic, back up the Keystore file, and back up your private key. These three methods work the same way. Users can click 【Backup Account】 after creating an account, or you can enter the【Backup Account】 page after selecting the corresponding account in the 【Account Management】 page, and select the way to back up the account and follow the corresponding prompts .<br />Please note: The backup file can be used to import the account and control the assets in the account. Keep the backup file safe and avoid being acquired by others."
  },
  {
    "q": "Does recharge arrive account immediately?",
    "a": "Recharge balance have two methods. Currently, only recharge the blockchain account is open, recharge with CNY will be opened later by which pay in CNY, obtain the UGT in the balance. When you use CNY to recharge, the balance arrives in real time; when you use blockchain to recharge, due to the conformation of blocks, there will be certain delay."
  },
  {
    "q": "Is there any relationship between the balance password and the blockchain account password?",
    "a": "The balance password is only used to protect the balance assets. It is used in balance-related scenarios such as consumption; and the balance password can be reset. The blockchain account password is used only while operating the chain assets or accounts, and cannot be modified or retrieved, but the account set to a new password after importing the backup file to new device. Blockchain account password is not used for blockchain account retrieval."
  }
]